In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [5]:
df_new = df[['AreaName', 1980]]
df_new = df_new.head()

# between() on Numeric field

In [6]:
df_new

  AreaName  1980
0     Asia    16
1   Europe     1
2   Africa    80
3  Oceania     0
4   Europe     0

In [9]:
df_new[1980].between(1,80)  # >=1 & <=80

0     True
1     True
2     True
3    False
4    False
Name: 1980, dtype: bool

In [10]:
df_new[df_new[1980].between(1,80)]

  AreaName  1980
0     Asia    16
1   Europe     1
2   Africa    80

# between() on String Field

In [11]:
df_new

  AreaName  1980
0     Asia    16
1   Europe     1
2   Africa    80
3  Oceania     0
4   Europe     0

In [12]:
df_new["AreaName"].between("Africa","Europe") # >= "Africa" & <= "Europe"

0     True
1     True
2     True
3    False
4     True
Name: AreaName, dtype: bool

In [13]:
df_new[df_new["AreaName"].between("Africa","Europe")]

  AreaName  1980
0     Asia    16
1   Europe     1
2   Africa    80
4   Europe     0

# between() on Date Field

df_new[Date_Col_Name].between("YYYY-MM-DD", "YYYY-MM-DD")

# between() on Time Field

df_new[Time_Col_Name].between("8:30AM", "9:30PM")